ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F0xx/stm32f030xc.h
#define DMA_CCR_MEM2MEM_Pos    (14U)                                           
#define DMA_CCR_MEM2MEM_Msk    (0x1U << DMA_CCR_MEM2MEM_Pos)                   /*!< 0x00004000 */
#define DMA_CCR_MEM2MEM        DMA_CCR_MEM2MEM_Msk                             /*!< Memory to memory mode               */

/******************  Bit definition for DMA_CNDTR register  *******************/
#define DMA_CNDTR_NDT_Pos      (0U)                                            
#define DMA_CNDTR_NDT_Msk      (0xFFFFU << DMA_CNDTR_NDT_Pos)                  /*!< 0x0000FFFF */
#define DMA_CNDTR_NDT          DMA_CNDTR_NDT_Msk                               /*!< Number of data to Transfer          */

/******************  Bit definition for DMA_CPAR register  ********************/
#define DMA_CPAR_PA_Pos        (0U)                                            
#define DMA_CPAR_PA_Msk        (0xFFFFFFFFU << DMA_CPAR_PA_Pos)                /*!< 0xFFFFFFFF */
#define DMA_CPAR_PA            DMA_CPAR_PA_Msk                                 /*!< Peripheral Address                  */

/******************  Bit definition for DMA_CMAR register  ********************/
#define DMA_CMAR_MA_Pos        (0U)                                            
#define DMA_CMAR_MA_Msk        (0xFFFFFFFFU << DMA_CMAR_MA_Pos)                /*!< 0xFFFFFFFF */
#define DMA_CMAR_MA            DMA_CMAR_MA_Msk                                 /*!< Memory Address                      */

/******************  Bit definition for DMA1_CSELR register  ********************/
#define DMA_CSELR_C1S_Pos      (0U)                                            
#define DMA_CSELR_C1S_Msk      (0xFU << DMA_CSELR_C1S_Pos)                     /*!< 0x0000000F */
#define DMA_CSELR_C1S          DMA_CSELR_C1S_Msk                               /*!< Channel 1 Selection */
#define DMA_CSELR_C2S_Pos      (4U)                                            
#define DMA_CSELR_C2S_Msk      (0xFU << DMA_CSELR_C2S_Pos)                     /*!< 0x000000F0 */
#define DMA_CSELR_C2S          DMA_CSELR_C2S_Msk                               /*!< Channel 2 Selection */
#define DMA_CSELR_C3S_Pos      (8U)                                            
#define DMA_CSELR_C3S_Msk      (0xFU << DMA_CSELR_C3S_Pos)                     /*!< 0x00000F00 */
#define DMA_CSELR_C3S          DMA_CSELR_C3S_Msk                               /*!< Channel 3 Selection */
#define DMA_CSELR_C4S_Pos      (12U)                                           
#define DMA_CSELR_C4S_Msk      (0xFU << DMA_CSELR_C4S_Pos)                     /*!< 0x0000F000 */
#define DMA_CSELR_C4S          DMA_CSELR_C4S_Msk                               /*!< Channel 4 Selection */
#define DMA_CSELR_C5S_Pos      (16U)                                           
#define DMA_CSELR_C5S_Msk      (0xFU << DMA_CSELR_C5S_Pos)                     /*!< 0x000F0000 */
#define DMA_CSELR_C5S          DMA_CSELR_C5S_Msk                               /*!< Channel 5 Selection */
#define DMA_CSELR_C6S_Pos      (20U)                                           
#define DMA_CSELR_C6S_Msk      (0xFU << DMA_CSELR_C6S_Pos)                     /*!< 0x00F00000 */
#define DMA_CSELR_C6S          DMA_CSELR_C6S_Msk                               /*!< Channel 6 Selection */
#define DMA_CSELR_C7S_Pos      (24U)                                           
#define DMA_CSELR_C7S_Msk      (0xFU << DMA_CSELR_C7S_Pos)                     /*!< 0x0F000000 */
#define DMA_CSELR_C7S          DMA_CSELR_C7S_Msk                               /*!< Channel 7 Selection */

#define DMA1_CSELR_DEFAULT              (0x00000000U)                          /*!< Default remap position for DMA1 */
#define DMA1_CSELR_CH1_ADC_Pos          (0U)                                   
#define DMA1_CSELR_CH1_ADC_Msk          (0x1U << DMA1_CSELR_CH1_ADC_Pos)       /*!< 0x00000001 */
#define DMA1_CSELR_CH1_ADC              DMA1_CSELR_CH1_ADC_Msk                 /*!< Remap ADC on DMA1 Channel 1*/
#define DMA1_CSELR_CH1_TIM17_CH1_Pos    (0U)                                   
#define DMA1_CSELR_CH1_TIM17_CH1_Msk    (0x7U << DMA1_CSELR_CH1_TIM17_CH1_Pos) /*!< 0x00000007 */
#define DMA1_CSELR_CH1_TIM17_CH1        DMA1_CSELR_CH1_TIM17_CH1_Msk           /*!< Remap TIM17 channel 1 on DMA1 channel 1 */
#define DMA1_CSELR_CH1_TIM17_UP_Pos     (0U)                                   
#define DMA1_CSELR_CH1_TIM17_UP_Msk     (0x7U << DMA1_CSELR_CH1_TIM17_UP_Pos)  /*!< 0x00000007 */
#define DMA1_CSELR_CH1_TIM17_UP         DMA1_CSELR_CH1_TIM17_UP_Msk            /*!< Remap TIM17 up on DMA1 channel 1 */
#define DMA1_CSELR_CH1_USART1_RX_Pos    (3U)                                   
#define DMA1_CSELR_CH1_USART1_RX_Msk    (0x1U << DMA1_CSELR_CH1_USART1_RX_Pos) /*!< 0x00000008 */
#define DMA1_CSELR_CH1_USART1_RX        DMA1_CSELR_CH1_USART1_RX_Msk           /*!< Remap USART1 Rx on DMA1 channel 1 */
#define DMA1_CSELR_CH1_USART2_RX_Pos    (0U)                                   
#define DMA1_CSELR_CH1_USART2_RX_Msk    (0x9U << DMA1_CSELR_CH1_USART2_RX_Pos) /*!< 0x00000009 */
#define DMA1_CSELR_CH1_USART2_RX        DMA1_CSELR_CH1_USART2_RX_Msk           /*!< Remap USART2 Rx on DMA1 channel 1 */
#define DMA1_CSELR_CH1_USART3_RX_Pos    (1U)                                   
#define DMA1_CSELR_CH1_USART3_RX_Msk    (0x5U << DMA1_CSELR_CH1_USART3_RX_Pos) /*!< 0x0000000A */
#define DMA1_CSELR_CH1_USART3_RX        DMA1_CSELR_CH1_USART3_RX_Msk           /*!< Remap USART3 Rx on DMA1 channel 1 */
#define DMA1_CSELR_CH1_USART4_RX_Pos    (0U)                                   
#define DMA1_CSELR_CH1_USART4_RX_Msk    (0xBU << DMA1_CSELR_CH1_USART4_RX_Pos) /*!< 0x0000000B */
#define DMA1_CSELR_CH1_USART4_RX        DMA1_CSELR_CH1_USART4_RX_Msk           /*!< Remap USART4 Rx on DMA1 channel 1 */
#define DMA1_CSELR_CH1_USART5_RX_Pos    (2U)                                   
#define DMA1_CSELR_CH1_USART5_RX_Msk    (0x3U << DMA1_CSELR_CH1_USART5_RX_Pos) /*!< 0x0000000C */
#define DMA1_CSELR_CH1_USART5_RX        DMA1_CSELR_CH1_USART5_RX_Msk           /*!< Remap USART5 Rx on DMA1 channel 1 */
#define DMA1_CSELR_CH1_USART6_RX_Pos    (0U)                                   
#define DMA1_CSELR_CH1_USART6_RX_Msk    (0xDU << DMA1_CSELR_CH1_USART6_RX_Pos) /*!< 0x0000000D */
#define DMA1_CSELR_CH1_USART6_RX        DMA1_CSELR_CH1_USART6_RX_Msk           /*!< Remap USART6 Rx on DMA1 channel 1 */
#define DMA1_CSELR_CH2_ADC_Pos          (4U)                                   
#define DMA1_CSELR_CH2_ADC_Msk          (0x1U << DMA1_CSELR_CH2_ADC_Pos)       /*!< 0x00000010 */
#define DMA1_CSELR_CH2_ADC              DMA1_CSELR_CH2_ADC_Msk                 /*!< Remap ADC on DMA1 channel 2 */
#define DMA1_CSELR_CH2_I2C1_TX_Pos      (5U)                                   
#define DMA1_CSELR_CH2_I2C1_TX_Msk      (0x1U << DMA1_CSELR_CH2_I2C1_TX_Pos)   /*!< 0x00000020 */
#define DMA1_CSELR_CH2_I2C1_TX          DMA1_CSELR_CH2_I2C1_TX_Msk             /*!< Remap I2C1 Tx on DMA1 channel 2 */
#define DMA1_CSELR_CH2_SPI1_RX_Pos      (4U)                                   
#define DMA1_CSELR_CH2_SPI1_RX_Msk      (0x3U << DMA1_CSELR_CH2_SPI1_RX_Pos)   /*!< 0x00000030 */
#define DMA1_CSELR_CH2_SPI1_RX          DMA1_CSELR_CH2_SPI1_RX_Msk             /*!< Remap SPI1 Rx on DMA1 channel 2 */
#define DMA1_CSELR_CH2_TIM1_CH1_Pos     (6U)                                   
#define DMA1_CSELR_CH2_TIM1_CH1_Msk     (0x1U << DMA1_CSELR_CH2_TIM1_CH1_Pos)  /*!< 0x00000040 */
#define DMA1_CSELR_CH2_TIM1_CH1         DMA1_CSELR_CH2_TIM1_CH1_Msk            /*!< Remap TIM1 channel 1 on DMA1 channel 2 */
#define DMA1_CSELR_CH2_TIM17_CH1_Pos    (4U)                                   
#define DMA1_CSELR_CH2_TIM17_CH1_Msk    (0x7U << DMA1_CSELR_CH2_TIM17_CH1_Pos) /*!< 0x00000070 */
#define DMA1_CSELR_CH2_TIM17_CH1        DMA1_CSELR_CH2_TIM17_CH1_Msk           /*!< Remap TIM17 channel 1 on DMA1 channel 2 */
#define DMA1_CSELR_CH2_TIM17_UP_Pos     (4U)                                   
#define DMA1_CSELR_CH2_TIM17_UP_Msk     (0x7U << DMA1_CSELR_CH2_TIM17_UP_Pos)  /*!< 0x00000070 */
#define DMA1_CSELR_CH2_TIM17_UP         DMA1_CSELR_CH2_TIM17_UP_Msk            /*!< Remap TIM17 up on DMA1 channel 2 */
#define DMA1_CSELR_CH2_USART1_TX_Pos    (7U)                                   
#define DMA1_CSELR_CH2_USART1_TX_Msk    (0x1U << DMA1_CSELR_CH2_USART1_TX_Pos) /*!< 0x00000080 */
#define DMA1_CSELR_CH2_USART1_TX        DMA1_CSELR_CH2_USART1_TX_Msk           /*!< Remap USART1 Tx on DMA1 channel 2 */
#define DMA1_CSELR_CH2_USART2_TX_Pos    (4U)                                   
#define DMA1_CSELR_CH2_USART2_TX_Msk    (0x9U << DMA1_CSELR_CH2_USART2_TX_Pos) /*!< 0x00000090 */
#define DMA1_CSELR_CH2_USART2_TX        DMA1_CSELR_CH2_USART2_TX_Msk           /*!< Remap USART2 Tx on DMA1 channel 2 */
#define DMA1_CSELR_CH2_USART3_TX_Pos    (5U)                                   
#define DMA1_CSELR_CH2_USART3_TX_Msk    (0x5U << DMA1_CSELR_CH2_USART3_TX_Pos) /*!< 0x000000A0 */
#define DMA1_CSELR_CH2_USART3_TX        DMA1_CSELR_CH2_USART3_TX_Msk           /*!< Remap USART3 Tx on DMA1 channel 2 */
#define DMA1_CSELR_CH2_USART4_TX_Pos    (4U)                                   
#define DMA1_CSELR_CH2_USART4_TX_Msk    (0xBU << DMA1_CSELR_CH2_USART4_TX_Pos) /*!< 0x000000B0 */
#define DMA1_CSELR_CH2_USART4_TX        DMA1_CSELR_CH2_USART4_TX_Msk           /*!< Remap USART4 Tx on DMA1 channel 2 */
#define DMA1_CSELR_CH2_USART5_TX_Pos    (6U)                                   
#define DMA1_CSELR_CH2_USART5_TX_Msk    (0x3U << DMA1_CSELR_CH2_USART5_TX_Pos) /*!< 0x000000C0 */
#define DMA1_CSELR_CH2_USART5_TX        DMA1_CSELR_CH2_USART5_TX_Msk           /*!< Remap USART5 Tx on DMA1 channel 2 */
#define DMA1_CSELR_CH2_USART6_TX_Pos    (4U)                                   
#define DMA1_CSELR_CH2_USART6_TX_Msk    (0xDU << DMA1_CSELR_CH2_USART6_TX_Pos) /*!< 0x000000D0 */
#define DMA1_CSELR_CH2_USART6_TX        DMA1_CSELR_CH2_USART6_TX_Msk           /*!< Remap USART6 Tx on DMA1 channel 2 */
#define DMA1_CSELR_CH3_TIM6_UP_Pos      (8U)                                   
#define DMA1_CSELR_CH3_TIM6_UP_Msk      (0x1U << DMA1_CSELR_CH3_TIM6_UP_Pos)   /*!< 0x00000100 */
#define DMA1_CSELR_CH3_TIM6_UP          DMA1_CSELR_CH3_TIM6_UP_Msk             /*!< Remap TIM6 up on DMA1 channel 3 */
#define DMA1_CSELR_CH3_I2C1_RX_Pos      (9U)                                   
#define DMA1_CSELR_CH3_I2C1_RX_Msk      (0x1U << DMA1_CSELR_CH3_I2C1_RX_Pos)   /*!< 0x00000200 */
#define DMA1_CSELR_CH3_I2C1_RX          DMA1_CSELR_CH3_I2C1_RX_Msk             /*!< Remap I2C1 Rx on DMA1 channel 3 */
#define DMA1_CSELR_CH3_SPI1_TX_Pos      (8U)                                   
#define DMA1_CSELR_CH3_SPI1_TX_Msk      (0x3U << DMA1_CSELR_CH3_SPI1_TX_Pos)   /*!< 0x00000300 */
#define DMA1_CSELR_CH3_SPI1_TX          DMA1_CSELR_CH3_SPI1_TX_Msk             /*!< Remap SPI1 Tx on DMA1 channel 3 */
#define DMA1_CSELR_CH3_TIM1_CH2_Pos     (10U)                                  
#define DMA1_CSELR_CH3_TIM1_CH2_Msk     (0x1U << DMA1_CSELR_CH3_TIM1_CH2_Pos)  /*!< 0x00000400 */
#define DMA1_CSELR_CH3_TIM1_CH2         DMA1_CSELR_CH3_TIM1_CH2_Msk            /*!< Remap TIM1 channel 2 on DMA1 channel 3 */
#define DMA1_CSELR_CH3_TIM16_CH1_Pos    (8U)                                   
#define DMA1_CSELR_CH3_TIM16_CH1_Msk    (0x7U << DMA1_CSELR_CH3_TIM16_CH1_Pos) /*!< 0x00000700 */
#define DMA1_CSELR_CH3_TIM16_CH1        DMA1_CSELR_CH3_TIM16_CH1_Msk           /*!< Remap TIM16 channel 1 on DMA1 channel 3 */
#define DMA1_CSELR_CH3_TIM16_UP_Pos     (8U)                                   
#define DMA1_CSELR_CH3_TIM16_UP_Msk     (0x7U << DMA1_CSELR_CH3_TIM16_UP_Pos)  /*!< 0x00000700 */
#define DMA1_CSELR_CH3_TIM16_UP         DMA1_CSELR_CH3_TIM16_UP_Msk            /*!< Remap TIM16 up on DMA1 channel 3 */
#define DMA1_CSELR_CH3_USART1_RX_Pos    (11U)                                  
#define DMA1_CSELR_CH3_USART1_RX_Msk    (0x1U << DMA1_CSELR_CH3_USART1_RX_Pos) /*!< 0x00000800 */
#define DMA1_CSELR_CH3_USART1_RX        DMA1_CSELR_CH3_USART1_RX_Msk           /*!< Remap USART1 Rx on DMA1 channel 3 */
#define DMA1_CSELR_CH3_USART2_RX_Pos    (8U)                                   
#define DMA1_CSELR_CH3_USART2_RX_Msk    (0x9U << DMA1_CSELR_CH3_USART2_RX_Pos) /*!< 0x00000900 */
#define DMA1_CSELR_CH3_USART2_RX        DMA1_CSELR_CH3_USART2_RX_Msk           /*!< Remap USART2 Rx on DMA1 channel 3 */
#define DMA1_CSELR_CH3_USART3_RX_Pos    (9U)                                   
#define DMA1_CSELR_CH3_USART3_RX_Msk    (0x5U << DMA1_CSELR_CH3_USART3_RX_Pos) /*!< 0x00000A00 */
#define DMA1_CSELR_CH3_USART3_RX        DMA1_CSELR_CH3_USART3_RX_Msk           /*!< Remap USART3 Rx on DMA1 channel 3 */
#define DMA1_CSELR_CH3_USART4_RX_Pos    (8U)                                   
#define DMA1_CSELR_CH3_USART4_RX_Msk    (0xBU << DMA1_CSELR_CH3_USART4_RX_Pos) /*!< 0x00000B00 */
#define DMA1_CSELR_CH3_USART4_RX        DMA1_CSELR_CH3_USART4_RX_Msk           /*!< Remap USART4 Rx on DMA1 channel 3 */
#define DMA1_CSELR_CH3_USART5_RX_Pos    (10U)                                  
#define DMA1_CSELR_CH3_USART5_RX_Msk    (0x3U << DMA1_CSELR_CH3_USART5_RX_Pos) /*!< 0x00000C00 */
#define DMA1_CSELR_CH3_USART5_RX        DMA1_CSELR_CH3_USART5_RX_Msk           /*!< Remap USART5 Rx on DMA1 channel 3 */
#define DMA1_CSELR_CH3_USART6_RX_Pos    (8U)                                   
#define DMA1_CSELR_CH3_USART6_RX_Msk    (0xDU << DMA1_CSELR_CH3_USART6_RX_Pos) /*!< 0x00000D00 */
#define DMA1_CSELR_CH3_USART6_RX        DMA1_CSELR_CH3_USART6_RX_Msk           /*!< Remap USART6 Rx on DMA1 channel 3 */
#define DMA1_CSELR_CH4_TIM7_UP_Pos      (12U)                                  
#define DMA1_CSELR_CH4_TIM7_UP_Msk      (0x1U << DMA1_CSELR_CH4_TIM7_UP_Pos)   /*!< 0x00001000 */
#define DMA1_CSELR_CH4_TIM7_UP          DMA1_CSELR_CH4_TIM7_UP_Msk             /*!< Remap TIM7 up on DMA1 channel 4 */
#define DMA1_CSELR_CH4_I2C2_TX_Pos      (13U)                                  
#define DMA1_CSELR_CH4_I2C2_TX_Msk      (0x1U << DMA1_CSELR_CH4_I2C2_TX_Pos)   /*!< 0x00002000 */
#define DMA1_CSELR_CH4_I2C2_TX          DMA1_CSELR_CH4_I2C2_TX_Msk             /*!< Remap I2C2 Tx on DMA1 channel 4 */
#define DMA1_CSELR_CH4_SPI2_RX_Pos      (12U)                                  
#define DMA1_CSELR_CH4_SPI2_RX_Msk      (0x3U << DMA1_CSELR_CH4_SPI2_RX_Pos)   /*!< 0x00003000 */
#define DMA1_CSELR_CH4_SPI2_RX          DMA1_CSELR_CH4_SPI2_RX_Msk             /*!< Remap SPI2 Rx on DMA1 channel 4 */
#define DMA1_CSELR_CH4_TIM2_CH4_Pos     (12U)                                  
#define DMA1_CSELR_CH4_TIM2_CH4_Msk     (0x5U << DMA1_CSELR_CH4_TIM2_CH4_Pos)  /*!< 0x00005000 */
#define DMA1_CSELR_CH4_TIM2_CH4         DMA1_CSELR_CH4_TIM2_CH4_Msk            /*!< Remap TIM2 channel 4 on DMA1 channel 4 */
#define DMA1_CSELR_CH4_TIM3_CH1_Pos     (13U)                                  
#define DMA1_CSELR_CH4_TIM3_CH1_Msk     (0x3U << DMA1_CSELR_CH4_TIM3_CH1_Pos)  /*!< 0x00006000 */
#define DMA1_CSELR_CH4_TIM3_CH1         DMA1_CSELR_CH4_TIM3_CH1_Msk            /*!< Remap TIM3 channel 1 on DMA1 channel 4 */
#define DMA1_CSELR_CH4_TIM3_TRIG_Pos    (13U)                                  
#define DMA1_CSELR_CH4_TIM3_TRIG_Msk    (0x3U << DMA1_CSELR_CH4_TIM3_TRIG_Pos) /*!< 0x00006000 */
#define DMA1_CSELR_CH4_TIM3_TRIG        DMA1_CSELR_CH4_TIM3_TRIG_Msk           /*!< Remap TIM3 Trig on DMA1 channel 4 */
#define DMA1_CSELR_CH4_TIM16_CH1_Pos    (12U)                                  
#define DMA1_CSELR_CH4_TIM16_CH1_Msk    (0x7U << DMA1_CSELR_CH4_TIM16_CH1_Pos) /*!< 0x00007000 */
#define DMA1_CSELR_CH4_TIM16_CH1        DMA1_CSELR_CH4_TIM16_CH1_Msk           /*!< Remap TIM16 channel 1 on DMA1 channel 4 */
#define DMA1_CSELR_CH4_TIM16_UP_Pos     (12U)                                  
#define DMA1_CSELR_CH4_TIM16_UP_Msk     (0x7U << DMA1_CSELR_CH4_TIM16_UP_Pos)  /*!< 0x00007000 */
#define DMA1_CSELR_CH4_TIM16_UP         DMA1_CSELR_CH4_TIM16_UP_Msk            /*!< Remap TIM16 up on DMA1 channel 4 */
#define DMA1_CSELR_CH4_USART1_TX_Pos    (15U)                                  
#define DMA1_CSELR_CH4_USART1_TX_Msk    (0x1U << DMA1_CSELR_CH4_USART1_TX_Pos) /*!< 0x00008000 */
#define DMA1_CSELR_CH4_USART1_TX        DMA1_CSELR_CH4_USART1_TX_Msk           /*!< Remap USART1 Tx on DMA1 channel 4 */
#define DMA1_CSELR_CH4_USART2_TX_Pos    (12U)                                  
#define DMA1_CSELR_CH4_USART2_TX_Msk    (0x9U << DMA1_CSELR_CH4_USART2_TX_Pos) /*!< 0x00009000 */
#define DMA1_CSELR_CH4_USART2_TX        DMA1_CSELR_CH4_USART2_TX_Msk           /*!< Remap USART2 Tx on DMA1 channel 4 */
#define DMA1_CSELR_CH4_USART3_TX_Pos    (13U)                                  
#define DMA1_CSELR_CH4_USART3_TX_Msk    (0x5U << DMA1_CSELR_CH4_USART3_TX_Pos) /*!< 0x0000A000 */
#define DMA1_CSELR_CH4_USART3_TX        DMA1_CSELR_CH4_USART3_TX_Msk           /*!< Remap USART3 Tx on DMA1 channel 4 */
#define DMA1_CSELR_CH4_USART4_TX_Pos    (12U)                                  
#define DMA1_CSELR_CH4_USART4_TX_Msk    (0xBU << DMA1_CSELR_CH4_USART4_TX_Pos) /*!< 0x0000B000 */
#define DMA1_CSELR_CH4_USART4_TX        DMA1_CSELR_CH4_USART4_TX_Msk           /*!< Remap USART4 Tx on DMA1 channel 4 */
#define DMA1_CSELR_CH4_USART5_TX_Pos    (14U)                                  
#define DMA1_CSELR_CH4_USART5_TX_Msk    (0x3U << DMA1_CSELR_CH4_USART5_TX_Pos) /*!< 0x0000C000 */
#define DMA1_CSELR_CH4_USART5_TX        DMA1_CSELR_CH4_USART5_TX_Msk           /*!< Remap USART5 Tx on DMA1 channel 4 */
#define DMA1_CSELR_CH4_USART6_TX_Pos    (12U)                                  
#define DMA1_CSELR_CH4_USART6_TX_Msk    (0xDU << DMA1_CSELR_CH4_USART6_TX_Pos) /*!< 0x0000D000 */
#define DMA1_CSELR_CH4_USART6_TX        DMA1_CSELR_CH4_USART6_TX_Msk           /*!< Remap USART6 Tx on DMA1 channel 4 */
#define DMA1_CSELR_CH5_I2C2_RX_Pos      (17U)                                  
#define DMA1_CSELR_CH5_I2C2_RX_Msk      (0x1U << DMA1_CSELR_CH5_I2C2_RX_Pos)   /*!< 0x00020000 */
#define DMA1_CSELR_CH5_I2C2_RX          DMA1_CSELR_CH5_I2C2_RX_Msk             /*!< Remap I2C2 Rx on DMA1 channel 5 */
#define DMA1_CSELR_CH5_SPI2_TX_Pos      (16U)                                  
#define DMA1_CSELR_CH5_SPI2_TX_Msk      (0x3U << DMA1_CSELR_CH5_SPI2_TX_Pos)   /*!< 0x00030000 */
#define DMA1_CSELR_CH5_SPI2_TX          DMA1_CSELR_CH5_SPI2_TX_Msk             /*!< Remap SPI1 Tx on DMA1 channel 5 */
#define DMA1_CSELR_CH5_TIM1_CH3_Pos     (18U)                                  
#define DMA1_CSELR_CH5_TIM1_CH3_Msk     (0x1U << DMA1_CSELR_CH5_TIM1_CH3_Pos)  /*!< 0x00040000 */
#define DMA1_CSELR_CH5_TIM1_CH3         DMA1_CSELR_CH5_TIM1_CH3_Msk            /*!< Remap TIM1 channel 3 on DMA1 channel 5 */
#define DMA1_CSELR_CH5_USART1_RX_Pos    (19U)                                  
#define DMA1_CSELR_CH5_USART1_RX_Msk    (0x1U << DMA1_CSELR_CH5_USART1_RX_Pos) /*!< 0x00080000 */
#define DMA1_CSELR_CH5_USART1_RX        DMA1_CSELR_CH5_USART1_RX_Msk           /*!< Remap USART1 Rx on DMA1 channel 5 */
#define DMA1_CSELR_CH5_USART2_RX_Pos    (16U)                                  
#define DMA1_CSELR_CH5_USART2_RX_Msk    (0x9U << DMA1_CSELR_CH5_USART2_RX_Pos) /*!< 0x00090000 */
#define DMA1_CSELR_CH5_USART2_RX        DMA1_CSELR_CH5_USART2_RX_Msk           /*!< Remap USART2 Rx on DMA1 channel 5 */
#define DMA1_CSELR_CH5_USART3_RX_Pos    (17U)                                  
#define DMA1_CSELR_CH5_USART3_RX_Msk    (0x5U << DMA1_CSELR_CH5_USART3_RX_Pos) /*!< 0x000A0000 */
#define DMA1_CSELR_CH5_USART3_RX        DMA1_CSELR_CH5_USART3_RX_Msk           /*!< Remap USART3 Rx on DMA1 channel 5 */
#define DMA1_CSELR_CH5_USART4_RX_Pos    (16U)                                  
#define DMA1_CSELR_CH5_USART4_RX_Msk    (0xBU << DMA1_CSELR_CH5_USART4_RX_Pos) /*!< 0x000B0000 */
#define DMA1_CSELR_CH5_USART4_RX        DMA1_CSELR_CH5_USART4_RX_Msk           /*!< Remap USART4 Rx on DMA1 channel 5 */
#define DMA1_CSELR_CH5_USART5_RX_Pos    (18U)                                  
#define DMA1_CSELR_CH5_USART5_RX_Msk    (0x3U << DMA1_CSELR_CH5_USART5_RX_Pos) /*!< 0x000C0000 */
#define DMA1_CSELR_CH5_USART5_RX        DMA1_CSELR_CH5_USART5_RX_Msk           /*!< Remap USART5 Rx on DMA1 channel 5 */
#define DMA1_CSELR_CH5_USART6_RX_Pos    (16U)                                  
#define DMA1_CSELR_CH5_USART6_RX_Msk    (0xDU << DMA1_CSELR_CH5_USART6_RX_Pos) /*!< 0x000D0000 */
#define DMA1_CSELR_CH5_USART6_RX        DMA1_CSELR_CH5_USART6_RX_Msk           /*!< Remap USART6 Rx on DMA1 channel 5 */
/******************************************************************************/
/*                                                                            */
/*                 External Interrupt/Event Controller (EXTI)                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for EXTI_IMR register  *******************/
#define EXTI_IMR_MR0_Pos          (0U)                                         
#define EXTI_IMR_MR0_Msk          (0x1U << EXTI_IMR_MR0_Pos)                   /*!< 0x00000001 */
#define EXTI_IMR_MR0              EXTI_IMR_MR0_Msk                             /*!< Interrupt Mask on line 0  */
#define EXTI_IMR_MR1_Pos          (1U)                                         
#define EXTI_IMR_MR1_Msk          (0x1U << EXTI_IMR_MR1_Pos)                   /*!< 0x00000002 */
#define EXTI_IMR_MR1              EXTI_IMR_MR1_Msk                             /*!< Interrupt Mask on line 1  */
#define EXTI_IMR_MR2_Pos          (2U)                                         
#define EXTI_IMR_MR2_Msk          (0x1U << EXTI_IMR_MR2_Pos)                   /*!< 0x00000004 */
#define EXTI_IMR_MR2              EXTI_IMR_MR2_Msk                             /*!< Interrupt Mask on line 2  */
#define EXTI_IMR_MR3_Pos          (3U)                                         
#define EXTI_IMR_MR3_Msk          (0x1U << EXTI_IMR_MR3_Pos)                   /*!< 0x00000008 */
#define EXTI_IMR_MR3              EXTI_IMR_MR3_Msk                             /*!< Interrupt Mask on line 3  */
#define EXTI_IMR_MR4_Pos          (4U)                                         
#define EXTI_IMR_MR4_Msk          (0x1U << EXTI_IMR_MR4_Pos)                   /*!< 0x00000010 */
#define EXTI_IMR_MR4              EXTI_IMR_MR4_Msk                             /*!< Interrupt Mask on line 4  */
#define EXTI_IMR_MR5_Pos          (5U)                                         
#define EXTI_IMR_MR5_Msk          (0x1U << EXTI_IMR_MR5_Pos)                   /*!< 0x00000020 */
#define EXTI_IMR_MR5              EXTI_IMR_MR5_Msk                             /*!< Interrupt Mask on line 5  */
#define EXTI_IMR_MR6_Pos          (6U)                                         
#define EXTI_IMR_MR6_Msk          (0x1U << EXTI_IMR_MR6_Pos)                   /*!< 0x00000040 */
#define EXTI_IMR_MR6              EXTI_IMR_MR6_Msk                             /*!< Interrupt Mask on line 6  */
#define EXTI_IMR_MR7_Pos          (7U)                                         
#define EXTI_IMR_MR7_Msk          (0x1U << EXTI_IMR_MR7_Pos)                   /*!< 0x00000080 */
#define EXTI_IMR_MR7              EXTI_IMR_MR7_Msk                             /*!< Interrupt Mask on line 7  */
#define EXTI_IMR_MR8_Pos          (8U)                                         
#define EXTI_IMR_MR8_Msk          (0x1U << EXTI_IMR_MR8_Pos)                   /*!< 0x00000100 */
#define EXTI_IMR_MR8              EXTI_IMR_MR8_Msk                             /*!< Interrupt Mask on line 8  */
#define EXTI_IMR_MR9_Pos          (9U)                                         
#define EXTI_IMR_MR9_Msk          (0x1U << EXTI_IMR_MR9_Pos)                   /*!< 0x00000200 */
